dad-better-backend/app/controllers/auth_controller.rb

  def create
    @user = User.find_by(username: user_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "username1"], ["LIMIT", 1]]

  def assign_daily_tasks(user)
    if not tasks_assigned_today?(user) and not tasks_completed_today?(user)
      for i in 1..5
        random_task = rand(1..Task.all.length)
        AssignedTask.create(user_id: user.id, task_id: random_task)
---
SELECT "tasks".* FROM "tasks"
INSERT INTO "assigned_tasks" ("user_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["task_id", 11], ["created_at", "2022-11-10 13:57:42.129643"], ["updated_at", "2022-11-10 13:57:42.129643"]]

  def tasks_assigned_today?(user)
    return user.assigned_tasks.where(created_at: Time.current.all_day).length == 5
---
SELECT "assigned_tasks".* FROM "assigned_tasks" WHERE "assigned_tasks"."user_id" = ? AND "assigned_tasks"."created_at" BETWEEN ? AND ?  [["user_id", 12], ["created_at", "2022-11-06 00:00:00"], ["created_at", "2022-11-06 23:59:59.999999"]]

  def tasks_completed_today?(user)
    return user.completed_tasks.where(created_at: Time.current.all_day).length > 0
---
SELECT "completed_tasks".* FROM "completed_tasks" WHERE "completed_tasks"."user_id" = ? AND "completed_tasks"."created_at" BETWEEN ? AND ?  [["user_id", 3], ["created_at", "2022-11-06 00:00:00"], ["created_at", "2022-11-06 23:59:59.999999"]]