dad-better-backend/app/controllers/tasks_controller.rb

SELECT 1 AS one FROM "tasks" WHERE "tasks"."identifier" = ? LIMIT ?  [["identifier", "82gqciGBdFd"], ["LIMIT", 1]]
INSERT INTO "tasks" ("description", "identifier", "value", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create_task(response)
    object = JSON.parse(response).with_indifferent_access
    unless Task.exists?(identifier: object[:id])
      newTask = Task.create(description: object[:joke], identifier: object[:id], value: 10, category: 'joke')

SELECT "tasks".* FROM "tasks"
INSERT INTO "assigned_tasks" ("user_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["task_id", 13], ["created_at", "2022-11-11 16:30:36.565636"], ["updated_at", "2022-11-11 16:30:36.565636"]]
---
  def assign_tasks
    10.times do
      random_task_id = rand(1..Task.all.length)
      AssignedTask.create(user_id: 3, task_id: random_task_id)