dad-better-backend/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("username", "name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def valid_user(user)
    if user.valid?
      user.save
---
UPDATE "users" SET "score" = ?, "level" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["score", 0], ["level", 0], ["updated_at", "2022-11-13 19:01:18.029102"], ["id", 6]]

  def show
    # add assigned tasks and completed tasks
    user = User.find_by_id(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

  def update_user
    @user = User.find_by_id(params[:user][:user_id])
    @message = ''
    @update_type = params[:user][:update_type]
    case @update_type
    when 'task_completed'
      @task = Task.find_by_id(params[:user][:task_id])
      mark_task_completed(@user, @task)
      @user.calc_score
      update_badge(@user)
    when 'task_favorited'
      @completed_task = CompletedTask.find_by_id(params[:user][:task_id])
      favorite_task(@completed_task)
    when 'update_user_settings'
      @user = User.find_by_id(params[:user][:user_id])
      update_user_settings(@user)
    when 'update_password'
      update_password(@user)
    end
    @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "completed_tasks"."id" FROM "completed_tasks" WHERE "completed_tasks"."user_id" = ?  [["user_id", 12]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "score" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["score", 400], ["updated_at", "2022-11-10 19:29:17.396051"], ["id", 3]]