dad-better-backend/app/controllers/users_controller.rb

UPDATE "users" SET "score" = ?, "level" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["score", 0], ["level", 0], ["updated_at", "2022-11-06 16:03:52.615128"], ["id", 3]]
---
  def create
    @user = User.create(user_params)
    @user.score = 0
    @user.level = 0
    if @user.valid?
      @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "score" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["score", 860], ["updated_at", "2022-11-06 15:13:33.812109"], ["id", 12]]
---
  def updatescore
    @user = User.find_by_id(params[:user][:user_id])
    original_score = @user.score
    @user.score = @user.score + (params[:user][:score]).to_i
    @user.save