dad-better-backend/app/controllers/users_controller.rb

  def update_user
    @user = User.find_by_id(params[:user][:user_id])
    @message = ''
    @update_type = params[:user][:update_type]
    case @update_type
    when 'task_completed'
      @task = Task.find_by_id(params[:user][:task_id])
      update_badge(@user)
      mark_task_completed(@user, @task)
    when 'task_favorited'
      @completed_task = CompletedTask.find_by_id(params[:user][:task_id])
---
SELECT "completed_tasks"."id" FROM "completed_tasks" WHERE "completed_tasks"."user_id" = ?  [["user_id", 1]]